def repeat_message(k):
    if k in range(3, 5):
        print("\n------------------------------------------"
              "\nВозможно стоит попробовать другой вариант?"
              "\n------------------------------------------")
    elif k in range(5, 10):
        print("\n----------------------------------------------------------"
              "\nИспользуйте иной параметр! Иначе программа перезапустится!"
              "\n----------------------------------------------------------")
    elif k > 10:
        print("\n----------------------------------------------------------------------"
              "\nИз-за некорректных действий пользователя программа будет перезапущена!\n")
        print("\n.....................Перезапуск программы.............................\n"
              "\n----------------------------------------------------------------------\n")
        return 1
    return 0
